#Importação das bibliotecas básicas

In [ ]:
!pip install plotly --upgrade

Collecting plotly
  Downloading https://files.pythonhosted.org/packages/1f/f6/bd3c17c8003b6641df1228e80e1acac97ed8402635e46c2571f8e1ef63af/plotly-4.14.3-py2.py3-none-any.whl (13.2MB)
     |████████████████████████████████| 13.2MB 282kB/s
Requirement already satisfied, skipping upgrade: six in /usr/local/lib/python3.7/dist-packages (from plotly) (1.15.0)
Requirement already satisfied, skipping upgrade: retrying>=1.3.3 in /usr/local/lib/python3.7/dist-packages (from plotly) (1.3.3)
Installing collected packages: plotly
  Found existing installation: plotly 4.4.1
    Uninstalling plotly-4.4.1:
      Successfully uninstalled plotly-4.4.1
Successfully installed plotly-4.14.3

In [2]:
import pandas as pd
import numpy as np 
import seaborn as sns #para visualização de graficos 
import matplotlib.pyplot as plt #também para visualizaçáo de gráficos 
import plotly.express as px  #para a criação de tabelas dinâmicas

#Base de Dados de Crédito

Fonte (adaptado): https://www.kaggle.com/laotse/credit-risk-datase

#Exploração dos dados

In [14]:
base_credit = pd.read_csv('/content/credit_data.csv') #importação da base de dados com Pandas

In [15]:
base_credit  #print base de dados

      clientid        income        age         loan  default
0            1  66155.925095  59.017015  8106.532131        0
1            2  34415.153966  48.117153  6564.745018        0
2            3  57317.170063  63.108049  8020.953296        0
3            4  42709.534201  45.751972  6103.642260        0
4            5  66952.688845  18.584336  8770.099235        1
...        ...           ...        ...          ...      ...
1995      1996  59221.044874  48.518179  1926.729397        0
1996      1997  69516.127573  23.162104  3503.176156        0
1997      1998  44311.449262  28.017167  5522.786693        1
1998      1999  43756.056605  63.971796  1622.722598        0
1999      2000  69436.579552  56.152617  7378.833599        0

[2000 rows x 5 columns]

In [16]:
base_credit.head() #Cabeçalho, os 5 primeiros registros

   clientid        income        age         loan  default
0         1  66155.925095  59.017015  8106.532131        0
1         2  34415.153966  48.117153  6564.745018        0
2         3  57317.170063  63.108049  8020.953296        0
3         4  42709.534201  45.751972  6103.642260        0
4         5  66952.688845  18.584336  8770.099235        1

In [17]:
base_credit.tail() #Rabo, os ultimo registros

      clientid        income        age         loan  default
1995      1996  59221.044874  48.518179  1926.729397        0
1996      1997  69516.127573  23.162104  3503.176156        0
1997      1998  44311.449262  28.017167  5522.786693        1
1998      1999  43756.056605  63.971796  1622.722598        0
1999      2000  69436.579552  56.152617  7378.833599        0

In [18]:
base_credit.describe() #algumas estatísticas

          clientid        income          age          loan      default
count  2000.000000   2000.000000  1997.000000   2000.000000  2000.000000
mean   1000.500000  45331.600018    40.807559   4444.369695     0.141500
std     577.494589  14326.327119    13.624469   3045.410024     0.348624
min       1.000000  20014.489470   -52.423280      1.377630     0.000000
25%     500.750000  32796.459717    28.990415   1939.708847     0.000000
50%    1000.500000  45789.117313    41.317159   3974.719419     0.000000
75%    1500.250000  57791.281668    52.587040   6432.410625     0.000000
max    2000.000000  69995.685578    63.971796  13766.051239     1.000000

In [21]:
base_credit[base_credit['income'] >= 69995.685578]  #Filtro para encontrarmos um criente específico.

     clientid        income        age         loan  default
422       423  69995.685578  52.719673  2084.370861        0

In [23]:
base_credit[base_credit['loan'] <= 1.377630	 ]

     clientid        income        age     loan  default
865       866  28072.604355  54.142548  1.37763        0